<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Seeder;

class CategoriesTableSeeder extends Seeder
{
    public function run()
    {
        $categories = [
            ['name' => 'Мотоциклы'],
            ['name' => 'Грузовики и спецтехника'],
            ['name' => 'Автозапчасти'],
            ['name' => 'Квартиры'],
            ['name' => 'Дома'],
            ['name' => 'Коммерческая недвижимость'],
            ['name' => 'Земельные участки'],
            ['name' => 'Аренда'],
            ['name' => 'Ремонт и строительство'],
            ['name' => 'Грузоперевозки'],
            ['name' => 'Образование и курсы'],
            ['name' => 'Красота и здоровье'],
            ['name' => 'Фото и видео'],
            ['name' => 'Смартфоны'],
            ['name' => 'Компьютеры'],
            ['name' => 'Ноутбуки'],
            ['name' => 'Планшеты'],
            ['name' => 'ТВ и аудио'],
            ['name' => 'Фотоаппараты'],
            ['name' => 'Женская одежда'],
            ['name' => 'Мужская одежда'],
            ['name' => 'Детская одежда'],
            ['name' => 'Обувь'],
            ['name' => 'Аксессуары'],
            ['name' => 'Спорт и отдых'],
            ['name' => 'Велосипеды'],
            ['name' => 'Туризм'],
            ['name' => 'Фитнес'],
            ['name' => 'Охота и рыбалка'],
            ['name' => 'Товары для дома'],
            ['name' => 'Мебель'],
            ['name' => 'Текстиль'],
            ['name' => 'Техника для дома'],
            ['name' => 'Инструменты'],
            ['name' => 'Животные'],
            ['name' => 'Собаки'],
            ['name' => 'Кошки'],
            ['name' => 'Птицы'],
            ['name' => 'Аквариумистика'],
            ['name' => 'Сельхозживотные'],
            ['name' => 'Для животных'],
            ['name' => 'Детские товары'],
            ['name' => 'Игрушки'],
            ['name' => 'Коляски'],
            ['name' => 'Одежда для детей'],
            ['name' => 'Автокресла'],
            ['name' => 'Работа'],
            ['name' => 'Вакансии'],
            ['name' => 'Резюме'],
            ['name' => 'Бизнес'],
            ['name' => 'Оборудование'],
            ['name' => 'Франшизы'],
            ['name' => 'Готовый бизнес'],
            ['name' => 'Прочее']
        ];

        foreach ($categories as $category) {
            Category::create($category);
        }
    }
}
